#+TITLE: Go Notes
#+DATE: 2020-09-01 10:40

#+EXPORT_FILE_NAME: go-notes
#+HUGO_WEIGHT: auto
#+HUGO_BASE_DIR: ~/G/blog
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_SECTION: notes
#+HUGO_CATEGORIES: notes
#+HUGO_TAGS: golang

**** Assignment and Declaration
#+BEGIN_SRC go :exports both :imports "fmt"
v := 1
{
	v = 2 // assignment
	fmt.Printf("Inner Assignment to v=%v\n", v)
}
fmt.Printf("After Assignment to v=%v\n", v)
#+END_SRC

#+RESULTS:
: Inner Assignment to v=2
: After Assignment to v=2

#+BEGIN_SRC go :exports both :imports "fmt"
v := 1
{
	v := 2 // short variable declaration
	fmt.Printf("Declared new v=%v\n", v)
}
fmt.Printf("Not changed old v=%v\n", v)
#+END_SRC

#+RESULTS:
: Declared new v=2
: Not changed old v=1

**** A slice/map contains itself
#+BEGIN_SRC go :exports both :imports "fmt"
type Foo []Foo
type M map[int]M
#+END_SRC

#+BEGIN_SRC go :exports both :imports "fmt"
func main() {
	s := []interface{}{"one", nil}
	s[1] = s // fmt.Println(s)  will cause max recursion exceed to stack overflow

	fmt.Println(s[0])

	s2 := s[1].([]interface{})
	fmt.Println(s2[0])

	s3 := s2[1].([]interface{})
	fmt.Println(s3[0])
}

func traverse(s []interface{}) {
	s1 := s[1].([]interface{})
	fmt.Println(s1[0])
	traverse(s1)
}
#+END_SRC

#+RESULTS:
: one
: one
: one
